// Увімкнути/вимкнути FLS (Full Logging System) (в роботі)
window['FLS'] = true;

// Підключення основного файлу стилів
import "../scss/style.scss"

// ========================================================================================================================================================================================================================================================
// Функціонал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as fdFunctions from "./modules/functions.js";

/* Перевірка підтримки webp, додавання класу webp або no-webp для HTML */
/* (i) необхідно для коректного відображення webp із css */
fdFunctions.isWebp();
/* Додавання класу touch для HTML якщо браузер мобільний */
// fdFunctions.addTouchClass();
/* Додавання loaded для HTML після повного завантаження сторінки */
// fdFunctions.addLoadedClass();
/* Модуль для роботи з меню (Бургер) */
fdFunctions.menuInit();
/* Враховування плаваючої панелі на мобільних пристроях при 100vh */
// fdFunctions.fullVHfix();
/* Форматування чисел */
// import './libs/wNumb.min.js';

/*
Модуль "Спойлери"
Сніппет (HTML): spollers
*/
// fdFunctions.spollers();

/*
Модуль "Таби"
Сніппет (HTML): tabs
*/
// fdFunctions.tabs();

/*
Модуль "Аккордион"
Сніппет (HTML): accordion
*/
// import "./libs/accordion.js";

/*
Модуль "Показати ще"
Сніппет (HTML): showmore
*/
// fdFunctions.showMore();

/*
Модуль "До/Після"
Сніппет (HTML): ba
*/
// import './libs/beforeafter.js';

/*
Модуль "Ефект хвиль"
Сниппет (HTML):
*/
// fdFunctions.rippleEffect();

/*
Модуль "Кастомний курсор"
Документация:
Сниппет (HTML):
*/
// fdFunctions.customCursor(true);

/*
Модуль "Попапи"
Сніппет (HTML): pl, pop
*/
import './libs/popup.js'

/*
Модуль паралаксу мишею
*/
// import './libs/parallax-mouse.js'

// ========================================================================================================================================================================================================================================================
// Робота з формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as fdForms from "./libs/forms/forms.js";

/* Робота з полями форми */

fdForms.formFieldsInit({
  viewPass: true,
  autoHeight: false
});

/* Надсилання форми */
fdForms.formSubmit();

/* Модуль форми "кількість" */
// fdForms.formQuantity();

/* Модуль зіркового рейтингу */
// fdForms.formRating();

/* Модуль роботи з select. */
import './libs/select.js'

/* Модуль роботи з календарем */
// import './libs/forms/datepicker.js'

/* (У роботі) Модуль роботи з масками.*/
/*
Підключення та налаштування виконується у файлі js/files/forms/inputmask.js
Документація по роботі у шаблоні:
Документація плагіна: https://github.com/RobinHerbots/inputmask
Сніппет(HTML):
*/
// import "./libs/forms/inputmask.js";

/* Модуль роботи з повзунком */
/*
Підключення та налаштування виконується у файлі js/files/forms/range.js
Документація по роботі у шаблоні:
Документація плагіна: https://refreshless.com/nouislider/
Сніппет (HTML): range
*/
// import "./libs/forms/range.js";

/* Модуль роботи з підказками (tippy) */
/*
Підключення плагіна Tippy.js та налаштування виконується у файлі js/files/tippy.js
Документація по роботі у шаблоні:
Документація плагіна: https://atomiks.github.io/tippyjs/
Сніппет (HTML): tip (додає атрибут з підказкою для html тега)
*/
// import "./libs/tippy.js";

// ========================================================================================================================================================================================================================================================
// Робота зі слайдером (Swiper) ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Налаштування підключення плагіна слайдера Swiper та нових слайдерів виконується у файлі js/files/sliders.js
Документація плагіна: https://swiperjs.com/
Сніппет(HTML): swiper
*/
// import "./libs/sliders.js";

// ========================================================================================================================================================================================================================================================
// Модулі роботи з прокручуванням сторінки ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/*
Зміна дизайну скроллбару
Документація по роботі у шаблоні: У HTML додаємо до блоку атрибут data-simplebar
Документація плагіна: https://github.com/Grsmto/simplebar/tree/master/packages/simplebar
Сніппет(HTML): 
*/
// import './libs/scroll/simplebar.js';

// Ліниве (відкладене) завантаження картинок
// Документація плагіна: https://github.com/verlok/vanilla-lazyload
// Сніппет(HTML):
// import './libs/scroll/lazyload.js';

// Спостерігач за об'єктами з атрибутом data-watch
// Сніппет(HTML):
// import './libs/watcher.js'

// Модуль поекранної прокрутки
// Сніппет(HTML):
// import './libs/fullpage.js'

// Модуль паралаксу
// Сніппет(HTML):
import './libs/parallax.js'

// Функції роботи скролом
// import * as fdScroll from "./libs/scroll/scroll.js";

// Плавна навігація по сторінці
// fdScroll.pageNavigation();

// Функціонал додавання класів до хедеру під час прокручування
// fdScroll.headerScroll();

// Модуль анімація цифрового лічильника
// Сніппет(HTML):
// fdScroll.digitsCounter();

// ========================================================================================================================================================================================================================================================
// Галерея ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Документація плагіна: https://www.lightgalleryjs.com/docs/
Сніппет(HTML):
*/
// import "./libs/gallery.js";

// ========================================================================================================================================================================================================================================================
// Масонрі сітка ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Сніппет(HTML):
*/
// import "./libs/isotope.js";

// ========================================================================================================================================================================================================================================================
// Інші плагіни ============================================================================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/* Динамічний адаптив */
// import "./libs/dynamic_adapt.js";

// ========================================================================================================================================================================================================================================================
// Інше ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/* Підключаємо файли зі своїм кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================
